#include <stdio.h>
int main()
{
    int a[10];
    int b[10];
    int *c = a;
    //数组名一般情况下指针常量表示
    //指针比下标更有效率
    //数组与指针的区别
    //指针效率更高，数组可读性更好
    // int vector[5]={1,2,3,4,5};
    // int test[]={1,2,3,4,5,6,90,89};
    char message[]="Hello";//这个是数组
    char *nessage2="Hello";//这个是常量

    // int c[10][10];
    //数组元素的存储顺序，从右到左递增
    //二维数组==指针数组(每一元素都是数组)
    //多维数组指向首指针元素
    //c指向的是c[0],c+1指向的是c[1]
    //c[0][2]访问指针中的某个指针的间接访问
    //指向数组的指针
    int vector[10],*vp=vector;
    int matrix[3][10];
    for(int i=0;i<3;i++){
        for(int j=0;j<10;j++){
            matrix[i][j]=i+j;
        }
    }
    //将指针数组的首指针赋值给指定值
    int *mp=&matrix[1][0];
    //首先对p间接访问，然后下标引用指向某个数组
    //通过对应的值来赋值,指针的表达式一定是一个指针
    //类型推断
    int (*p)[10]=matrix+1;
    printf("%d",(*p)[8]);
    int *p1=&matrix[0][0];
    //指针数组每一个都是字符指针，指向一个字符数组,更加节省空间







}